{
  "destinations": {
    "marrakech": {
      "id": "marrakech",
      "name": {
        "fr": "Marrakech",
        "ar": "مراكش"
      },
      "subtitle": {
        "fr": "La Perle du Sud",
        "ar": "لؤلؤة الجنوب"
      },
      "description": {
        "fr": "Marrakech, la « Ville Rouge », est l'une des quatre villes impériales du Maroc. Fondée en 1062 par les Almoravides, elle fut la capitale de puissants empires berbères. Son cœur historique, la médina, classée au patrimoine mondial de l'UNESCO, abrite des trésors architecturaux exceptionnels.",
        "ar": "مراكش، \"المدينة الحمراء\"، هي إحدى المدن الإمبراطورية الأربع في المغرب. تأسست عام 1062 من قبل المرابطين، وكانت عاصمة إمبراطوريات بربرية قوية. قلبها التاريخي، المدينة العتيقة، المدرجة في التراث العالمي لليونسكو، تضم كنوزاً معمارية استثنائية."
      },
      "history": {
        "fr": "Marrakech fut fondée en 1062 par Youssef Ibn Tachfin, chef des Almoravides. Elle devint rapidement un centre commercial majeur reliant l'Afrique subsaharienne au monde méditerranéen. Sous les Almohades (XIIe-XIIIe siècles), la ville connut son apogée avec la construction de la Koutoubia. Les dynasties saâdiennes et alaouites enrichirent la ville de palais somptueux comme El Badi et Bahia.",
        "ar": "تأسست مراكش عام 1062 على يد يوسف بن تاشفين، زعيم المرابطين. سرعان ما أصبحت مركزاً تجارياً رئيسياً يربط أفريقيا جنوب الصحراء بالعالم المتوسطي. في عهد الموحدين (القرنان الثاني عشر والثالث عشر)، شهدت المدينة ذروتها مع بناء الكتبية. أثرت السلالات السعدية والعلوية المدينة بقصور فخمة مثل البديع والبهية."
      },
      "monuments": [
        {
          "name": {
            "fr": "Mosquée Koutoubia",
            "ar": "مسجد الكتبية"
          },
          "description": {
            "fr": "Chef-d'œuvre de l'art almohade (XIIe siècle), la Koutoubia est la plus grande mosquée de Marrakech. Son minaret de 69 mètres, visible de toute la ville, est orné de motifs géométriques en grès rose. Le nom 'Koutoubia' vient des libraires (kutubiyyin) qui vendaient leurs manuscrits à proximité.",
            "ar": "تحفة من الفن الموحدي (القرن الثاني عشر)، الكتبية هي أكبر مسجد في مراكش. مئذنتها البالغة 69 متراً، المرئية من جميع أنحاء المدينة، مزينة بأنماط هندسية من الحجر الرملي الوردي. اسم 'الكتبية' يأتي من بائعي الكتب الذين كانوا يبيعون مخطوطاتهم بالقرب منها."
          },
          "architecture": {
            "fr": "Architecture almohade typique avec minaret carré, décoration sobre mais élégante en grès rose de la région. Influence sur l'architecture de la Giralda de Séville et de la Tour Hassan de Rabat.",
            "ar": "عمارة موحدية نموذجية مع مئذنة مربعة، زخرفة بسيطة لكن أنيقة من الحجر الرملي الوردي المحلي. تأثير على عمارة خيرالدا في إشبيلية وصومعة حسان في الرباط."
          },
          "visiting": {
            "fr": "Accessible uniquement de l'extérieur pour les non-musulmans. Meilleure vue depuis les jardins adjacents ou les terrasses des cafés environnants.",
            "ar": "يمكن الوصول إليها من الخارج فقط لغير المسلمين. أفضل منظر من الحدائق المجاورة أو شرفات المقاهي المحيطة."
          }
        },
        {
          "name": {
            "fr": "Palais de la Bahia",
            "ar": "قصر البهية"
          },
          "description": {
            "fr": "Construit entre 1866 et 1900 par le grand vizir Ahmed Ben Moussa (Ba Ahmed), ce palais de 8 hectares compte 150 pièces. Son nom signifie 'la brillante', en hommage à l'épouse favorite du vizir. Il représente l'apogée de l'art décoratif marocain du XIXe siècle.",
            "ar": "بُني بين 1866 و 1900 من قبل الوزير الأعظم أحمد بن موسى (با أحمد)، هذا القصر الذي يمتد على 8 هكتارات يضم 150 غرفة. اسمه يعني 'البراقة'، تيمناً بالزوجة المفضلة للوزير. يمثل ذروة الفن الزخرفي المغربي في القرن التاسع عشر."
          },
          "architecture": {
            "fr": "Mélange d'architecture andalouse et mauresque. Plafonds en cèdre sculpté, mosaïques de zellige, stucs ciselés, jardins à l'andalouse avec bassins et orangers. La Grande Cour en marbre blanc est particulièrement remarquable.",
            "ar": "مزيج من العمارة الأندلسية والمورية. أسقف من خشب الأرز المنحوت، فسيفساء الزليج، جص منحوت، حدائق أندلسية مع أحواض وأشجار البرتقال. الفناء الكبير من الرخام الأبيض ملفت للنظر بشكل خاص."
          },
          "visiting": {
            "fr": "Ouvert tous les jours. Visite libre ou guidée recommandée. Éviter les heures de pointe (11h-15h). Prévoir 1h30 de visite.",
            "ar": "مفتوح كل يوم. زيارة حرة أو مع مرشد موصى بها. تجنب ساعات الذروة (11-15). خطط لزيارة لمدة ساعة ونصف."
          }
        },
        {
          "name": {
            "fr": "Place Jemaa el-Fna",
            "ar": "ساحة جامع الفنا"
          },
          "description": {
            "fr": "Cœur battant de Marrakech, cette place millénaire est inscrite au patrimoine oral de l'humanité par l'UNESCO. Théâtre vivant où se mêlent conteurs, musiciens gnawa, charmeurs de serpents et marchands ambulants. Le soir, elle se transforme en un immense restaurant à ciel ouvert.",
            "ar": "قلب مراكش النابض، هذه الساحة الألفية مدرجة في التراث الشفهي للإنسانية من قبل اليونسكو. مسرح حي يختلط فيه الحكواتيون وموسيقيو الكناوة وسحرة الثعابين والباعة المتجولون. في المساء، تتحول إلى مطعم ضخم في الهواء الطلق."
          },
          "cultural_significance": {
            "fr": "Centre de la tradition orale marocaine depuis le XIe siècle. Lieu de rencontre entre les cultures berbère, arabe et africaine subsaharienne.",
            "ar": "مركز التقليد الشفهي المغربي منذ القرن الحادي عشر. مكان التقاء بين الثقافات البربرية والعربية والأفريقية جنوب الصحراء."
          }
        }
      ],
      "practical_info": {
        "best_time": {
          "fr": "Octobre à avril (climat doux). Éviter juillet-août (très chaud).",
          "ar": "أكتوبر إلى أبريل (مناخ معتدل). تجنب يوليو-أغسطس (حار جداً)."
        },
        "duration": {
          "fr": "2-3 jours minimum pour la médina et les monuments principaux.",
          "ar": "2-3 أيام كحد أدنى للمدينة العتيقة والآثار الرئيسية."
        },
        "highlights": {
          "fr": ["Mosquée Koutoubia", "Palais Bahia", "Tombeaux Saâdiens", "Jardins Majorelle", "Souks traditionnels"],
          "ar": ["مسجد الكتبية", "قصر البهية", "القبور السعدية", "حدائق ماجوريل", "الأسواق التقليدية"]
        }
      }
    },
    "fes": {
      "id": "fes",
      "name": {
        "fr": "Fès",
        "ar": "فاس"
      },
      "subtitle": {
        "fr": "Capitale Spirituelle du Maroc",
        "ar": "العاصمة الروحية للمغرب"
      },
      "description": {
        "fr": "Fès, fondée en 789, est la plus ancienne des villes impériales. Sa médina, Fès el-Bali, est la plus grande zone piétonne du monde et abrite l'université Al-Qarawiyyin, considérée comme la plus ancienne université en fonctionnement continu au monde.",
        "ar": "فاس، التي تأسست عام 789، هي أقدم المدن الإمبراطورية. مدينتها العتيقة، فاس البالي، هي أكبر منطقة للمشاة في العالم وتضم جامعة القرويين، التي تعتبر أقدم جامعة تعمل بشكل مستمر في العالم."
      },
      "history": {
        "fr": "Fondée par Idriss Ier en 789, Fès devint rapidement un centre intellectuel et religieux majeur. Sous les Almoravides et Almohades, elle rivalisa avec Cordoue et Bagdad. La ville accueillit les réfugiés andalous après la Reconquista, enrichissant son patrimoine culturel et artisanal.",
        "ar": "تأسست على يد إدريس الأول عام 789، سرعان ما أصبحت فاس مركزاً فكرياً ودينياً رئيسياً. في عهد المرابطين والموحدين، نافست قرطبة وبغداد. استقبلت المدينة اللاجئين الأندلسيين بعد الاسترداد، مما أثرى تراثها الثقافي والحرفي."
      },
      "monuments": [
        {
          "name": {
            "fr": "Université Al-Qarawiyyin",
            "ar": "جامعة القرويين"
          },
          "description": {
            "fr": "Fondée en 859 par Fatima al-Fihri, Al-Qarawiyyin est reconnue par l'UNESCO et le Livre Guinness des records comme la plus ancienne université en fonctionnement continu. Elle forma de nombreux savants musulmans, juifs et chrétiens, dont Averroès et Maïmonide.",
            "ar": "تأسست عام 859 على يد فاطمة الفهرية، القرويين معترف بها من قبل اليونسكو وموسوعة غينيس للأرقام القياسية كأقدم جامعة تعمل بشكل مستمر. خرّجت العديد من العلماء المسلمين واليهود والمسيحيين، بما في ذلك ابن رشد وابن ميمون."
          },
          "significance": {
            "fr": "Centre d'apprentissage qui influença l'Europe médiévale. Bibliothèque contenant des manuscrits rares datant du IXe siècle.",
            "ar": "مركز تعلم أثر على أوروبا في العصور الوسطى. مكتبة تحتوي على مخطوطات نادرة تعود إلى القرن التاسع."
          }
        },
        {
          "name": {
            "fr": "Bab Boujloud",
            "ar": "باب بوجلود"
          },
          "description": {
            "fr": "Porte principale d'entrée de la médina, construite en 1913 dans le style mauresque traditionnel. Ses céramiques bleues (côté extérieur) symbolisent Fès, tandis que le vert (côté intérieur) représente l'Islam. C'est l'une des portes les plus photographiées du Maroc.",
            "ar": "البوابة الرئيسية لدخول المدينة العتيقة، بُنيت عام 1913 بالطراز المغربي التقليدي. سيراميكها الأزرق (الجانب الخارجي) يرمز لفاس، بينما الأخضر (الجانب الداخلي) يمثل الإسلام. إنها واحدة من أكثر البوابات تصويراً في المغرب."
          }
        }
      ],
      "crafts": {
        "fr": "Fès est réputée pour ses artisans traditionnels : tanneurs (quartier Chouara), potiers, tisserands, maroquiniers et ébénistes. Les techniques ancestrales se transmettent de père en fils depuis des siècles.",
        "ar": "تشتهر فاس بحرفييها التقليديين: الدباغين (حي الشوارة)، الخزافين، النساجين، صناع الجلود والنجارين. تنتقل التقنيات الأجدادية من الأب إلى الابن منذ قرون."
      }
    },
    "casablanca": {
      "id": "casablanca",
      "name": {
        "fr": "Casablanca",
        "ar": "الدار البيضاء"
      },
      "subtitle": {
        "fr": "Capitale Économique du Maroc",
        "ar": "العاصمة الاقتصادية للمغرب"
      },
      "description": {
        "fr": "Casablanca, métropole moderne du Maroc, abrite la mosquée Hassan II, l'une des plus grandes mosquées au monde. Centre économique du pays, elle mélange architecture Art déco du protectorat français et modernité contemporaine.",
        "ar": "الدار البيضاء، العاصمة الحديثة للمغرب، تضم مسجد الحسن الثاني، أحد أكبر المساجد في العالم. المركز الاقتصادي للبلاد، تمزج بين العمارة الآرت ديكو من عهد الحماية الفرنسية والحداثة المعاصرة."
      },
      "monuments": [
        {
          "name": {
            "fr": "Mosquée Hassan II",
            "ar": "مسجد الحسن الثاني"
          },
          "description": {
            "fr": "Chef-d'œuvre architectural inauguré en 1993, conçu par Michel Pinseau. Son minaret de 210 mètres est le plus haut du monde. La mosquée peut accueillir 105 000 fidèles et dispose d'un toit ouvrant, d'un sol chauffant et d'un laser pointant vers La Mecque.",
            "ar": "تحفة معمارية افتتحت عام 1993، صممها ميشيل بينسو. مئذنتها البالغة 210 أمتار هي الأعلى في العالم. يمكن للمسجد استيعاب 105,000 مصل ويحتوي على سقف قابل للفتح وأرضية مدفأة وليزر يشير إلى مكة."
          },
          "architecture": {
            "fr": "Fusion de l'art mauresque traditionnel et des techniques modernes. Marbre de Carrare, granit du Tafilalet, bois de cèdre du Moyen Atlas. Un tiers de la mosquée est construit sur l'océan.",
            "ar": "مزج الفن المغربي التقليدي مع التقنيات الحديثة. رخام كرارا، جرانيت تافيلالت، خشب الأرز من الأطلس المتوسط. ثلث المسجد مبني على المحيط."
          }
        }
      ]
    },
    "chefchaouen": {
      "id": "chefchaouen", 
      "name": {
        "fr": "Chefchaouen",
        "ar": "شفشاون"
      },
      "subtitle": {
        "fr": "La Perle Bleue du Rif",
        "ar": "لؤلؤة الريف الزرقاء"
      },
      "description": {
        "fr": "Nichée dans les montagnes du Rif, Chefchaouen séduit par ses ruelles peintes en bleu et blanc. Fondée en 1471 comme forteresse contre les invasions portugaises, elle devint refuge des Andalous expulsés d'Espagne.",
        "ar": "تقع في جبال الريف، تسحر شفشاون بأزقتها المطلية بالأزرق والأبيض. تأسست عام 1471 كحصن ضد الغزوات البرتغالية، أصبحت ملجأ للأندلسيين المطرودين من إسبانيا."
      },
      "cultural_heritage": {
        "fr": "L'influence andalouse se ressent dans l'architecture, la cuisine et l'artisanat local. Les maisons bleues créent une atmosphère unique, inspirée des traditions berbères et de l'héritage juif séfarade.",
        "ar": "يُحس التأثير الأندلسي في العمارة والمطبخ والحرف المحلية. البيوت الزرقاء تخلق جواً فريداً، مستوحى من التقاليد البربرية والتراث اليهودي السفاردي."
      }
    },
    "essaouira": {
      "id": "essaouira",
      "name": {
        "fr": "Essaouira",
        "ar": "الصويرة"
      },
      "subtitle": {
        "fr": "Cité des Vents",
        "ar": "مدينة الرياح"
      },
      "description": {
        "fr": "Ancienne Mogador, Essaouira est une cité portuaire fortifiée du XVIIIe siècle, classée UNESCO. Ses remparts face à l'Atlantique, son port de pêche authentique et son festival Gnawa en font une destination unique.",
        "ar": "موكادور السابقة، الصويرة مدينة ساحلية محصنة من القرن الثامن عشر، مدرجة في اليونسكو. أسوارها المواجهة للأطلسي وميناؤها الأصيل ومهرجان الكناوة يجعلها وجهة فريدة."
      },
      "music_culture": {
        "fr": "Berceau de la musique Gnawa, fusion des traditions africaines subsahariennes et marocaines. Le Festival Gnawa et Musiques du Monde attire chaque année des milliers de mélomanes.",
        "ar": "مهد موسيقى الكناوة، مزج التقاليد الأفريقية جنوب الصحراء والمغربية. مهرجان الكناوة وموسيقى العالم يجذب آلاف عشاق الموسيقى سنوياً."
      }
    },
    "merzouga": {
      "id": "merzouga",
      "name": {
        "fr": "Merzouga",
        "ar": "مرزوقة"
      },
      "subtitle": {
        "fr": "Porte du Grand Sahara",
        "ar": "بوابة الصحراء الكبرى"
      },
      "description": {
        "fr": "Village aux portes de l'Erg Chebbi, Merzouga offre l'expérience authentique du désert saharien. Ses dunes dorées de 150 mètres de haut changent de couleur selon la lumière, créant un spectacle naturel inoubliable.",
        "ar": "قرية على أبواب عرق الشبي، مرزوقة تقدم تجربة أصيلة للصحراء. كثبانها الذهبية بارتفاع 150 متراً تغير لونها حسب الضوء، خالقة مشهداً طبيعياً لا يُنسى."
      },
      "desert_experience": {
        "fr": "Excursions à dos de chameau, nuits sous les étoiles en bivouac berbère, sandboard sur les dunes. Observation astronomique exceptionnelle grâce à l'absence de pollution lumineuse.",
        "ar": "رحلات على ظهر الجمال، ليالي تحت النجوم في مخيم بربري، تزلج على الكثبان. مراقبة فلكية استثنائية بفضل غياب التلوث الضوئي."
      }
    },
    "rabat": {
      "id": "rabat",
      "name": {
        "fr": "Rabat",
        "ar": "الرباط"
      },
      "subtitle": {
        "fr": "Capitale Politique du Royaume",
        "ar": "العاصمة السياسية للمملكة"
      },
      "description": {
        "fr": "Capitale administrative du Maroc depuis 1912, Rabat allie patrimoine historique et modernité. La ville abrite des monuments emblématiques comme la Tour Hassan et le Mausolée Mohammed V, témoins de la grandeur almohade et de l'histoire contemporaine.",
        "ar": "العاصمة الإدارية للمغرب منذ 1912، الرباط تجمع بين التراث التاريخي والحداثة. تضم المدينة معالم رمزية مثل صومعة حسان وضريح محمد الخامس، شاهدة على العظمة الموحدية والتاريخ المعاصر."
      },
      "monuments": [
        {
          "name": {
            "fr": "Tour Hassan",
            "ar": "صومعة حسان"
          },
          "description": {
            "fr": "Minaret inachevé de la mosquée Hassan, commencé en 1195 sous Yacoub al-Mansour. Haute de 44 mètres (au lieu des 86 prévus), elle devait être la plus grande mosquée du monde. Les 200 colonnes restantes témoignent de l'ambition almohade.",
            "ar": "مئذنة غير مكتملة لمسجد حسان، بدأت عام 1195 في عهد يعقوب المنصور. بارتفاع 44 متراً (بدلاً من 86 المخطط لها)، كان من المفترض أن تكون أكبر مسجد في العالم. الـ200 عمود المتبقية تشهد على الطموح الموحدي."
          }
        }
      ]
    }
  }
}
